<?php

//No
// $a = 2;
// $b = 3;

// if (!($a > $b)) {
//     echo "Yes";
// } else {
//     echo "No";
// }
// echo ($a > $b) * 1;



//2
//3
// $a = 2;

// echo $a++;
// echo "<br>";
// echo $a;


//3
//3
// $a = 2;

// echo ++$a;
// echo "<br>";
// echo $a;

//5
// $a = 2;

// echo (++$a) + 2;


// 4
// $a = 2;

// echo ($a++) + 2;


// 4
// $a = 2;

// echo ($a--) + 2;

// 3
// $a = 2;

// echo (--$a) + 2;



// double
// $a=1.2;
// echo gettype($a);


// yes
// $a = 5;
// if (is_int($a)) {
//     echo "yes";
// } else {
//     echo "no";
// }


// 120
// $a = 1.2e2;
// echo $a;

//0.012
// $a = 1.2e-2;
// echo $a;


//100000000000
// $a = 1e11;
// echo $a;


//$a=3
// $a=3;
// echo "\$a=$a";

// echo "\tНовая \"строка\" \n перевод";



//Привет Вася Привет Петя
// $name="Петя";
// $a=<<<TEXT
// Привет Вася
// Привет $name
// TEXT;

// echo $a;



//Array ( [0] => 1 [1] => 2 [2] => 3 [3] => 4 [4] => 5 )
//Array
//(
//   [0] => 1
//  [1] => 2
// [2] => 3
// [3] => 4
// [4] => 5
//)

//  $a = array(1, 2, 3, 4, 5);

// print_r($a);


// $a = [1, 2, 3, 4, 5];

// print_r($a);


//3
// $a = [1, 2, 3, 4, 5];

// echo $a[2];



// 1
// 2
// 3
// 4
// 5

// $a = [1, 2, 3, 4, 5];

// for ($i = 0; $i < 5; $i++) {
//     echo $a[$i]."<br>";
// }


//15
// $a = [1, 2, 3, 4, 5];
// $sum = 0;

// for ($i = 0; $i < 5; $i++) {
//     $sum = $sum + $a[$i];
// }

// echo $sum;

// Array ( [8] => 1 [9] => 2 [10] => 3 [11] => 4 [12] => 5 )

// $a = [8 => 1, 2, 3, 4, 5];

// print_r($a);


//Array ( [x] => 5 [y] => 7 )
// $a = ['x' => 5, 'y' => 7];

// print_r($a);


// $a=$_POST["a"];
// $b=$_POST["b"];

// if ($a==4 and $b=="Москва") {
//     echo "OK";
// } else{
//     echo "NO";
// }


$a = [$_POST["a"], $_POST["b"], $_POST["c"]];
$b = [4, "Москва", 6];
$x = 0;
$y = 0;

for ($i = 0; $i < 3; $i++) {
    if ($a[$i] == $b[$i]) {
        $x = $x + 1;
    } else {
        $y = $y + 1;
    }
}
if ($x >= 2) {
    echo "ВЫ прошли, правильных " . $x;
} else {
    echo "ВЫ  не прошли, неправильных " . $y;
}
